[
    {
        "logo": "superpayments.svg",
        "link": "https://www.superpayments.com",
        "text": "Super Payments is on a mission to offer free payments to business in the UK. Transactions feed all reporting and settlement processes, and in 2024, in pursuit of safety and performance, Super migrated to TigerBeetle to ensure financial consistency, increase internal confidence, and handle throughput and transactions per second requirements for the decade to come."
    },
    {
        "logo": "triplezip.svg",
        "link": "https://www.triplezip.ai",
        "text": "TripleZip is a commercial tenant portal, the easiest way to collect rent online for commercial properties. Implementing TigerBeetle to power TripleZip’s ledger—which tracks tenants, property managers, and payments—took just two days. The team rests easy on TigerBeetle’s extreme engineering, strict consistency, and reliability guarantees."
    },
    {
        "logo": "pesawise.svg",
        "link": "https://pesawise.com",
        "text": "Pesawise is an all-in-one platform for business payments in Kenya. TigerBeetle was adopted to solve month-end performance issues that were slowing the system down, impacting customers. The migration of millions of historical transactions was completed successfully in a weekend, and TigerBeetle is now the system of record."
    },
    {
        "logo": "Thndr.svg",
        "link": "https://thndr.app",
        "text": "Thndr is Egypt's # 1 investing app, the easiest wat to invest in stocks, gold and mutual funds, with a vision to democratise investment in the MENA region. During a revamp of the order management system, TigerBeetle was selected to power the company’s general ledger, to ensure all journals are under one unified system, and handle all money movements related to clients’ trading accounts – including deposits, withdrawals, and invoices."
    },
     {
        "logo": "wallet guru.svg",
        "link": "https://www.walletguru.com",
        "text": "Wallet Guru is a streaming payments platform that lets you manage how your viewing credits are used across compatible streaming platforms. Users can stream money as they watch, read, or connect by the minute, paragraph, or megabyte – powered by TigerBeetle."
    },
    {
        "logo": "Okto - Color.svg",
        "link": "https:///www.oktopayments.com",
        "text": "OKTO is trusted by businesses like TrueLayer, ePay and Euronet to create immersive fintech solutions for both consumers and businesses, allowing fast, easy and secure payments, in-store, online and on the move. Migrating their ledger to TigerBeetle at the end of 2024 unlocked critical OLTP performance, and correctness, in realtime."
    }
]
